I have since deleted the project, so the debug plan in this [Gist](https://gist.github.com/sam-humphreys/9f3e2800f05eb50a0adaf7e2ce3835c6) refers to project `gmex-example-20210325-1`. Summary:

```
Terraform will perform the following actions:

  # data.google_storage_transfer_project_service_account.stj-gmex-ex-20210325-state will be read during apply
  # (config refers to values not yet known)
 <= data "google_storage_transfer_project_service_account" "stj-gmex-ex-20210325-state"  {
      ~ email   = "project-473444228554@storage-transfer-service.iam.gserviceaccount.com" -> (known after apply)
      ~ id      = "project-473444228554@storage-transfer-service.iam.gserviceaccount.com" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # google_project.project will be updated in-place
  ~ resource "google_project" "project" {
        id                  = "projects/gmex-example-20210325-1"
      ~ labels              = {
          + "test"          = "yes"
            # (1 unchanged element hidden)
        }
        name                = "Test"
        # (5 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_member.stj-gmex-ex-20210325-state-reader must be replaced
-/+ resource "google_storage_bucket_iam_member" "stj-gmex-ex-20210325-state-reader" {
      ~ bucket = "b/gmex-ex-20210325-state" -> "gmex-ex-20210325-state"
      ~ etag   = "CAI=" -> (known after apply)
      ~ id     = "b/gmex-ex-20210325-state/roles/storage.admin/serviceaccount:project-473444228554@storage-transfer-service.iam.gserviceaccount.com" -> (known after apply)
      ~ member = "serviceAccount:project-473444228554@storage-transfer-service.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

As for the missing **project** on the `google_storage_bucket_iam_member` - I am assuming that it's not necessarily required. The reason being that **project** is specified within the `google_storage_bucket` resource and it would therefore be inferred, as well as being a resource-scoped permission rather than a project-scoped one.